---
kind: enumMember
id: F:Autodesk.Revit.DB.LineScaling.ViewScale
enum: Autodesk.Revit.DB.LineScaling
source: html/66e96d4a-6c06-0c50-bd03-f1db2ae83efb.htm
---
# Autodesk.Revit.DB.LineScaling.ViewScale

Exporting lines as they were scaled by view scale. This option preserves visual fidelity.